In [2]:
import pandas as pd

In [8]:
s = pd.Series([1 ,2 ,3])
s

0    1
1    2
2    3
dtype: int64

In [9]:
s1 = s[0]

In [11]:
s1 = s1 + 3
s1

7

In [12]:
s

0    1
1    2
2    3
dtype: int64

In [13]:
data = pd.read_csv('data.txt', sep=',')

In [14]:
data

  Name  Age  Gender
0  Nam   10    Male
1  Chi   11  Female
2  Dat   22    Male

In [15]:
data[data['Name']=='Nam']

  Name  Age Gender
0  Nam   10   Male

In [18]:
data['Gender'][2] = 'Other'

/home/dverse/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [78]:
data[(data.Gender == 'Male') | (data.Gender == 'Female')]

  Name  Age  Gender
0  Nam   10    Male
1  Chi   11  Female

In [40]:
data[data['Gender'].isin(['Male', 'Female'])]

  Name  Age  Gender
0  Nam   10    Male
1  Chi   11  Female

In [79]:
data[~data['Gender'].isin(['Male', 'Female'])]

  Name  Age Gender
2  Dat   22  Other

In [55]:
a= 12
b= 14
(a==13) or (b==14)

True

"|" is different with "or"

In [56]:
(a==12) or print('ABC')

True

In [63]:
def print_me():
    print("It's me")
    return 10

In [77]:
(a==2) | (10 == print_me())

It's me

True

In [76]:
(a==2) or print_me()

It's me

10

In [75]:
(a==2) & print_me()

It's me

0

In [74]:
(a==2) and print_me()

False

In [83]:
data['Salary'] = data.Age * 3

In [89]:
data

  Name  Age  Gender  Salary
0  Nam   10    Male      30
1  Chi   11  Female      33
2  Dat   22   Other      66

In [86]:
data.Age.sum()

43

In [87]:
data.Age.mean()

14.333333333333334

In [90]:
data.describe()

             Age     Salary
count   3.000000   3.000000
mean   14.333333  43.000000
std     6.658328  19.974984
min    10.000000  30.000000
25%    10.500000  31.500000
50%    11.000000  33.000000
75%    16.500000  49.500000
max    22.000000  66.000000

## Discriminative Analysis